doc/HomeworkClass1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Class 1 Homework</title>
<!-- 2015-07-24 Fri 07:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maurice Ling" />
</head>
<body>
<div id="content">
<h1 class="title">Class 1 Homework</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Notes on Doing Class Homework</a></li>
<li><a href="#sec-2">2. Class 1 Exercises</a>
<ul>
<li><a href="#sec-2-1">2.1. Blink variations</a></li>
<li><a href="#sec-2-2">2.2. Accelerometer Exercise</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Put Together Robot</a></li>
<li><a href="#sec-4">4. Calibrate Robot</a></li>
<li><a href="#sec-5">5. Connecting the IR Remote</a></li>
<li><a href="#sec-6">6. Robotics Merit Badge Workbook</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Notes on Doing Class Homework</h2>
<div class="outline-text-2" id="text-1">
<p>
Class homework reinforces what we covered in class and prepare you
for the next class.  If you have not setup GitHub, please follow the
instructions in the <a href="http://htmlpreview.github.com?https://github.com/mcli/RoboticsMB/blob/master/doc/RoboticsMB_Reference.html">RoboticsMB Reference</a> guide.
</p>

<p>
After each step, remember to commit all your source code using
GitHub after each exercise and synchronize to push your changes to
the server.  This way I can track your progress and help out if you
encounter any problems.
</p>

<p>
If you are stuck for more than half an hour on a programming issue,
send me an email or text and I will take a look at your program on
GitHub.  You will need to commit and push (synchronize) your changes
to GitHub so I can see your code.
</p>

<p>
Send me an email if you are done with all the homework or if you have
any questions.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Class 1 Exercises</h2>
<div class="outline-text-2" id="text-2">
<p>
These are exercises we started in class.  I've made some additions, 
so read through all the steps and do the ones that you haven't done yet.
There are hints in the <a href="https://github.com/mcli/RoboticsMB/blob/master/doc/RMB_Session1.pdf">class slides</a>.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Blink variations</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Upload the Blink Example to your board (Examples → 01.Basics)
</li>
<li>Save the pin number (13) in an “int” variable and replace all
instances of “13” with the variable. e.g. int ledPin=13;
</li>
<li>Modify the program to generate the SOS signal – 3 short, 3 long,
3 short, pause, then repeat.
</li>
<li>Save the program as BlinkSOS and commit using github client
</li>
<li>Revise the program to add 2 functions, shortBlinks() and
longBlinks(), to generate the SOS signal to make the program
shorter and more readable.
</li>
<li>Save the program again and commit using github client
</li>
<li>Revise the program to use one function instead of two (combine
shortBlinks() and longBlinks() into one).
</li>
<li>Save, commit, and synchronize to push your code to GitHub
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Accelerometer Exercise</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This exercise assumes you have set up Github and the Arduino IDE
following the RoboticsMB Reference guide (Those without GitHub access can
import the <a href="https://sites.google.com/a/rocketbrandstudios.com/rocket-brand-studios/tutorials/tutorials-lmr-tadpole-main/microM.zip?attredirects=0">microM library</a> into their Arduino IDE).
</p>
<ol class="org-ol">
<li>Load the MicroM example “impact”: Files →libraries → microM → impact 
</li>
<li>Open the Serial Monitor: Tools → Serial Monitor (or click on
icon on top right)
</li>
<li>Run program, then tap the board lightly from different
directions to see the delta values change
</li>
<li>Save the program into your sketches
</li>
<li>Modify the program to print the x, y, and z axis readings (not
the delta readings).  This will cause a lot of information to show to 
the screen.
</li>
<li>Turn the board in different directions and observe the readings.
</li>
<li>Commit all your source code using GitHub after each exercise and
synchronize to push your changes to the server.
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Put Together Robot</h2>
<div class="outline-text-2" id="text-3">
<p>
Put together your robot following the instructions on <a href="http://www.instructables.com/id/Rocket-Brand-Studios-Tadpole-Robot/">instructables.com</a>.
There are variations of the Tadpole.  Ours is the Educational version
with MicroMagician.
<b>Note</b> Our robot does not include the bumper switches mentioned in the instructions.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Calibrate Robot</h2>
<div class="outline-text-2" id="text-4">
<p>
Follow the <a href="https://sites.google.com/a/rocketbrandstudios.com/rocket-brand-studios/tutorials/tadpole-tutorials-microm">tutorials at RocketBrandStudios</a> to program and calibrate the motors:
</p>
<ol class="org-ol">
<li><a href="https://sites.google.com/a/rocketbrandstudios.com/rocket-brand-studios/tutorials/tutorials-tadpole-main/tadpole-tutorials-which-motor-is-which">Figure out which motor is which.</a>
</li>
<li><a href="https://sites.google.com/a/rocketbrandstudios.com/rocket-brand-studios/tutorials/tutorials-tadpole-main/tadpole-tutorials-motor-speed-and-go-straight">Calibrate the robot to go straight.</a>
</li>
<li>Commit all your source code using GitHub after each exercise and
synchronize to push your changes to the server.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Connecting the IR Remote</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>With a Sony or universal remote control, make a copy of the
<b>microM-&gt;IR Receiver</b> project and use it to determine what codes correspond
to which buttons on your remote.
</li>
<li>Write the button names/functions and the
corresponding codes in a table in your engineering notebook.
</li>
<li>Program your robot to turn left, right, and go straight using the IR remote 
control.
</li>
<li>Commit your source code using GitHub and synchronize to push your changes to the server.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Robotics Merit Badge Workbook</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Fill out Section 1a and b
</li>
<li>Get your Blue Card signed
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2015-07-07</p>
<p class="author">Author: Maurice Ling</p>
<p class="date">Created: 2015-07-24 Fri 07:09</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
